test/zoo/inheritance/ddl/inheritance_5_ddl.dbml
Table LACUS {
  magna VARCHAR(42) [pk, not null]
  vestibulum VARCHAR(42)
  tempor VARCHAR(42)
  fugit VARCHAR(42)
}

Table NEC {
  magna VARCHAR(42) [pk, not null]
  vestibulum VARCHAR(42)
  pulvinar VARCHAR(42)
  audis VARCHAR(42)
  "magna via_mollis" VARCHAR(42) [not null]
  "magna via_vitae" VARCHAR(42) [not null]
}

Table SODALES {
  magna VARCHAR(42) [pk, not null]
  vestibulum VARCHAR(42)
  convallis VARCHAR(42)
  ipsum VARCHAR(42)
}

Table ULTRICES {
  "magna sodales" VARCHAR(42) [not null]
  "magna lacus" VARCHAR(42) [not null]
  Indexes {
    ("magna sodales", "magna lacus") [pk]
  }
}

Ref:NEC."magna via_mollis" > LACUS.magna
Ref:NEC."magna via_vitae" > SODALES.magna
Ref:ULTRICES."magna sodales" > SODALES.magna
Ref:ULTRICES."magna lacus" > LACUS.magna
